[Killed] BlockStatement
main/components/HelpRequests/HelpRequestForm.js:64:47
               isInvalid={Boolean(errors.requesterEmail)}
               {...register("requesterEmail", {
                 required: "Requester email is required.",
-                validate: (requesterEmail) => {
-                  return (
-                    mailRegex.test(requesterEmail) ||
-                    "Please enter a valid email."
-                  );
-                },
+                validate: (requesterEmail) => {},
               })}
             />
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Please enter a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequests/HelpRequestForm.js:66:21
                 required: "Requester email is required.",
                 validate: (requesterEmail) => {
                   return (
-                    mailRegex.test(requesterEmail) ||
-                    "Please enter a valid email."
+                    mailRegex.test(requesterEmail) && "Please enter a valid email."
                   );
                 },
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Please enter a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.js:66:21
                 required: "Requester email is required.",
                 validate: (requesterEmail) => {
                   return (
-                    mailRegex.test(requesterEmail) ||
-                    "Please enter a valid email."
+                    false
                   );
                 },
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Please enter a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.js:67:21
                 validate: (requesterEmail) => {
                   return (
                     mailRegex.test(requesterEmail) ||
-                    "Please enter a valid email."
+                    ""
                   );
                 },
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Please enter a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:86:38
               id="teamId"
               type="text"
               isInvalid={Boolean(errors.teamId)}
-              {...register("teamId", {
-                required: "Team ID is required.",
-                validate: (teamId) => {
-                  return(
-                    //(Number.isInteger(Number(teamId)) && (Number(teamId) > 0)) ||  "Team ID must be a positive integer."
-                    Number.isInteger(Number(teamId)) || "Team ID must be a positive integer."
-                  ); 
-                },
-              })}
+              {...register("teamId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Team ID must be a positive integer./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/HelpRequests/HelpRequestForm.js:88:39
               isInvalid={Boolean(errors.teamId)}
               {...register("teamId", {
                 required: "Team ID is required.",
-                validate: (teamId) => {
-                  return(
-                    //(Number.isInteger(Number(teamId)) && (Number(teamId) > 0)) ||  "Team ID must be a positive integer."
-                    Number.isInteger(Number(teamId)) || "Team ID must be a positive integer."
-                  ); 
-                },
+                validate: (teamId) => {},
               })}
             />
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Team ID must be a positive integer./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequests/HelpRequestForm.js:91:21
                 validate: (teamId) => {
                   return(
                     //(Number.isInteger(Number(teamId)) && (Number(teamId) > 0)) ||  "Team ID must be a positive integer."
-                    Number.isInteger(Number(teamId)) || "Team ID must be a positive integer."
+                    //(Number.isInteger(Number(teamId)) && (Number(teamId) > 0)) ||  "Team ID must be a positive integer."
+Number.isInteger(Number(teamId)) && "Team ID must be a positive integer."
                   ); 
                 },
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Team ID must be a positive integer./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.js:91:21
                 validate: (teamId) => {
                   return(
                     //(Number.isInteger(Number(teamId)) && (Number(teamId) > 0)) ||  "Team ID must be a positive integer."
-                    Number.isInteger(Number(teamId)) || "Team ID must be a positive integer."
+                    true
                   ); 
                 },
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Team ID must be a positive integer./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.js:114:28
               id="tableOrBreakoutRoom"
               type="text"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-              {...register("tableOrBreakoutRoom")}
+              {...register("")}
             >
               <option value="breakout">Breakout</option>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] LogicalOperator
main/components/HelpRequests/HelpRequestForm.js:138:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime && "Time is required."}
+              {errors.requestTime || "Time is required."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.js:138:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime && "Time is required."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Time is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
