[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestIndexPage.js:3:48
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function HelpRequestIndexPage() {
-  // Stryker disable all : helprequest for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-        <p>
-          <a href="/helprequests/create">Create</a>
-        </p>
-        <p>
-          <a href="/helprequests/edit/1">Edit</a>
-        </p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function HelpRequestIndexPage() {}
 
killedBy: HelpRequestIndexPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Index page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
