[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:77:24
             required: "URL is required.",
             pattern: {
               value: urlRegex,
-              message: "Must be a valid URL starting with http:// or https://",
+              message: "",
             },
           })}
killedBy: ArticlesForm tests that url format validation works
statusReason: Error: Unable to find an element with the text: /Must be a valid URL starting with http:\/\/ or https:\/\//. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:109:33
           id="email"
           type="email"
           isInvalid={Boolean(errors.email)}
-          {...register("email", {
-            required: "Email is required.",
-            pattern: {
-              value: emailRegex,
-              message: "Invalid email address",
-            },
-          })}
+          {...register("email", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:129:37
           id="dateAdded"
           type="datetime-local"
           isInvalid={Boolean(errors.dateAdded)}
-          {...register("dateAdded", {
-            required: "Date is required.",
-          })}
+          {...register("dateAdded", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Date is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
