[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/organizations/edit/${cell.row.values.orgCode}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/organizations/edit/CSB"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/organizations/edit/${cell.row.values.orgCode}`);
+    navigate(``);
   };
 
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/organizations/edit/CSB"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:49:5
       Header: "Organization Translation",
       accessor: "orgTranslation",
     },
-    {
-      Header: "Inactive",
-      accessor: "inactive",
-      // for boolean
-      //   Cell: ({ cell }) => <span>{cell.value ? "True" : "False"}</span>,
-      Cell: ({ value }) => (value ? "True" : "False"),
-    },
+    {},
   ];
 
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.js:54:13
       accessor: "inactive",
       // for boolean
       //   Cell: ({ cell }) => <span>{cell.value ? "True" : "False"}</span>,
-      Cell: ({ value }) => (value ? "True" : "False"),
+      Cell: () => undefined,
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  False
Received:
