[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:19:43
     },
   });
 
-  const onSuccess = (ucsbOrganization) => {
-    toast(
-      `New UCSB Organization Created - orgCode: ${ucsbOrganization.orgCode}`,
-    );
-  };
+  const onSuccess = (ucsbOrganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New UCSB Organization Created - orgCode: csu"

Number of calls: 0

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:34:36
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (data) => {
-    data.inactive = data.inactive === "true";
-    mutation.mutate(data);
-  };
+  const onSubmit = async (data) => {};
 
   if (isSuccess && !storybook) {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] EqualityOperator
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:35:21
   const { isSuccess } = mutation;
 
   const onSubmit = async (data) => {
-    data.inactive = data.inactive === "true";
+    data.inactive = data.inactive !== "true";
     mutation.mutate(data);
   };
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:35:21
   const { isSuccess } = mutation;
 
   const onSubmit = async (data) => {
-    data.inactive = data.inactive === "true";
+    data.inactive = true;
     mutation.mutate(data);
   };
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
