[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:12:30
 export default function UCSBOrganizationIndexPage() {
   const { data: currentUser } = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsborganization/create"
-          style={{ float: "right" }}
-        >
-          Create UCSB Organization
-        </Button>
-      );
-    }
-    return null;
-  };
+  const createButton = () => {};
 
   const {
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSB Organization/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
