[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:22:15
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/ucsborganization`,
-      params: { orgCode: id }, // Ensure orgCode is passed here in params
+      params: {}, // Ensure orgCode is passed here in params
     },
   );
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:26:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsbOrganization) => ({
-    url: "/api/ucsborganization",
-    method: "PUT",
-    params: {
-      orgCode: ucsbOrganization.orgCode,
-    },
-    data: {
-      orgCode: ucsbOrganization.orgCode,
-      orgTranslationShort: ucsbOrganization.orgTranslationShort,
-      orgTranslation: ucsbOrganization.orgTranslation,
-      inactive: ucsbOrganization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbOrganization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "UCSB Organization Updated - orgCode: CSB"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
