[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:86:38
               id="teamId"
               type="text"
               isInvalid={Boolean(errors.teamId)}
-              {...register("teamId", {
-                required: "Team ID is required.",
-                validate: (teamId) => {
-                  return (
-                    Number.isInteger(Number(teamId)) ||
-                    "Team ID must be an integer."
-                  );
-                },
-              })}
+              {...register("teamId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Team ID must be an integer./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/HelpRequests/HelpRequestForm.js:88:39
               isInvalid={Boolean(errors.teamId)}
               {...register("teamId", {
                 required: "Team ID is required.",
-                validate: (teamId) => {
-                  return (
-                    Number.isInteger(Number(teamId)) ||
-                    "Team ID must be an integer."
-                  );
-                },
+                validate: (teamId) => {},
               })}
             />
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Team ID must be an integer./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequests/HelpRequestForm.js:90:21
                 required: "Team ID is required.",
                 validate: (teamId) => {
                   return (
-                    Number.isInteger(Number(teamId)) ||
-                    "Team ID must be an integer."
+                    Number.isInteger(Number(teamId)) && "Team ID must be an integer."
                   );
                 },
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Team ID must be an integer./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.js:90:21
                 required: "Team ID is required.",
                 validate: (teamId) => {
                   return (
-                    Number.isInteger(Number(teamId)) ||
-                    "Team ID must be an integer."
+                    false
                   );
                 },
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Team ID must be an integer./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.js:91:21
                 validate: (teamId) => {
                   return (
                     Number.isInteger(Number(teamId)) ||
-                    "Team ID must be an integer."
+                    ""
                   );
                 },
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Team ID must be an integer./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
