[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:33:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="MenuItemReview-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="/MenuItemReview-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:63:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemId && "ItemId is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /ItemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:83:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateReviewed && "dateReviewed is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /dateReviewed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:98:45
               id="reviewerEmail"
               type="email"
               isInvalid={Boolean(errors.reviewerEmail)}
-              {...register("reviewerEmail", {
-                required: "reviewerEmail is required.",
-              })}
+              {...register("reviewerEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /reviewerEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:125:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && "stars is required. "}
+              {errors.stars || "stars is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:125:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && "stars is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:140:28
               id="comments"
               type="text"
               isInvalid={Boolean(errors.comments)}
-              {...register("comments")} // comments should not be required, only stars
+              {...register("")} // comments should not be required, only stars
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
